gdgly/NUC97X_JS/STM32F4xx/DL698/RM_RxDATA_DL2007.cpp

#include "Project698.h"
#include "../DL698/DL698_DataDef.h"
#include "../DL698/RM_RxDATA.h"
#include "../DL698/RM_TxDATA.h"
#include "../DL698/MeterAutoReport.h"
#include "../DL698/RM_Event_DL2007.h"

#include "../Device/MEMRW.h"
#include "../STM32F4xx/STM32F4xx_UART.h"
#include "../Calculate/Calculate.h"
#include "../DL698/EVENT_Record.h"


#include "../DL698/DL698_JSON.h"

u32 RM_RxDATA_DL2007_CHECK(u32 PORTn)//DL645_2007帧接收数据,比较发收地址、控制码、数据标识、减0x33;返回:0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
{
	u32 i;
	u32 x;
	u8* p8rx;
	u8* p8;
	UARTCtrl_TypeDef * UARTCtrl;
	
	p8=p8;
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	if(PORTn==ACSAMPLEPORT)
	{
		p8rx=(u8 *)Get_ADDR_UARTnTx(PORTn);
	}else
	{
		p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
	}
	
/*
#if ((Project/100)==2)//集中器
#if SEL_RouterRunMode3ADDR==1//微功率无线发送帧目标地址:0=电能表地址，1=采集器地址
	if((PORTn==RS485_4PORT)&&(Terminal_Router->RouterRunMode_1==3))//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
	{//微功率无线,目标地址用采集器地址
		i=UARTCtrl->TaskID;
		i>>=8;
		i&=0xff;
		switch(i)
		{
			case RMTASKnoPOWER://停上电事件固定任务号
				i=UARTCtrl->MeterCount[i];
				i=PowerEvent->setno[i];
				break;
			default:
				i=UARTCtrl->MeterCount[i];
				break;
		}
		p8=(u8*)ADDR_6000_SDRAM+(i*LENper_6000);
		p8=Get_Element(p8,3,0,0);//计算元素地址
		if(p8)
		{//采集器可取
			p8+=5;
			x=p8[4]|(p8[5]<<8);
			i=(p8rx[1]<<8)|p8rx[2];
			if(i!=x)
			{
				return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
			}
			x=p8[2]|(p8[3]<<8);
			i=(p8rx[3]<<8)|p8rx[4];
			if(i!=x)
			{
				return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
			}
			x=p8[0]|(p8[1]<<8);
			i=(p8rx[5]<<8)|p8rx[6];
			if(i!=x)
			{
				return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
			}
		}
		else
		{
			return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
		}
	}
	else
#endif
#endif
*/
	{
		if(PORTn!=ACSAMPLEPORT)
		{//不是交采
			i=(p8rx[1]<<8)|p8rx[2];
			if(i!=UARTCtrl->RMAddr[2])
			{
				return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
			}
			i=(p8rx[3]<<8)|p8rx[4];
			if(i!=UARTCtrl->RMAddr[1])
			{
				return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
			}
			i=(p8rx[5]<<8)|p8rx[6];
			if(i!=UARTCtrl->RMAddr[0])
			{
				return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
			}
		}
	}
	
	//控制码
	if((p8rx[8]&0x40)!=0x0)
	{//从站异常回答
		UARTCtrl->RM_SubsequentFrames=0;//0=无读后续帧,1-n=读续帧的帧号
		return 2;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
	}
	//减0x33
	for(i=0;i<p8rx[9];i++)
	{
		p8rx[10+i]-=0x33;
	}
	//DI比较
	x=p8rx[10];
	x|=p8rx[10+1]<<8;
	x|=p8rx[10+2]<<16;
	x|=p8rx[10+3]<<24;
	if(x==0x04001501)
	{//主动上报状态字
		UARTCtrl->RM_SubsequentFrames=0;//0=无读后续帧,1-n=读续帧的帧号
		#if EnMeterAutoReportEvent==1//允许电能表主动上报事件:0=不允许,1=允许
			MeterAutoReportStateWord(PORTn,p8rx);//主动上报状态字;入口:自动上报接收帧;返回:0=没接受,1=接受
		#endif
		//数据处理完成,返回:4主动上报(已处理)
		return 4;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
	}
	i=UARTCtrl->RM_DI;//DL/T645-2007/1997当前抄表数据标识
	switch(i)
	{
	#if (USER/100)==15//安徽
		case 0x060000FF://全部6类负荷曲线(安徽)
	#endif
		case 0x06000001://全部6类负荷曲线
		case 0x06010001://1类负荷曲线(电压、电流、频率)
		case 0x06020001://2类负荷曲线(有无功功率)
		case 0x06030001://3类负荷曲线(功率因数)
		case 0x06040001://4类负荷曲线(正反有功,組合无功1和2总电能)
		case 0x06050001://5类负荷曲线(1-4象限无功总电能)
		case 0x06060001://6类负荷曲线(当前有功需量,当前无功需量)
			//采曲线数据,按任务执行间隔时间和采集方案采集间隔时间计算
			break;
		default:
			i=RM_TxDATA_DL2007_DI(PORTn,i);//抄表发送帧DI按上n次更改
			break;
	}
	if(x!=i)
	{
		return 3;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
	}
	return 0;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
}


__align(4) const u32 signed_DL2007_List[]=//DL/T-2007数据带有正负符号的数据标识列表
{
//1电能量类
	0x0000FFFF,//组合有功总电能
	0x0003FFFF,//组合无功1总电能
	0x0004FFFF,//组合无功2总电能
	0x001700FF,//A相组合无功1电能
	0x001800FF,//A相组合无功2电能
	0x002B00FF,//B相组合无功1电能
	0x002C00FF,//B相组合无功2电能
	0x003F00FF,//C相组合无功1电能
	0x004000FF,//C相组合无功2电能
	0x008000FF,//关联总电能
	0x009400FF,//A相关联总电能
	0x00A800FF,//B相关联总电能
	0x00BC00FF,//C相关联总电能

//2最大需量及发生时间类
	0x0103FFFF,//组合无功1总最大需量及发生时间
	0x0104FFFF,//组合无功1总最大需量及发生时间
	0x011700FF,//A相组合无功1最大需量及发生时间
	0x011800FF,//A相组合无功2最大需量及发生时间
	0x012B00FF,//B相组合无功1最大需量及发生时间
	0x012C00FF,//B相组合无功2最大需量及发生时间
	0x013F00FF,//C相组合无功1最大需量及发生时间
	0x014000FF,//C相组合无功2最大需量及发生时间

//3变量
	0x0202FF00,//电流
	0x02800001,//零线电流
	0x0203FF00,//瞬时有功功率
	0x0204FF00,//瞬时无功功率
	0x0205FF00,//瞬时视在功率
	0x0206FF00,//功率因数
	0x02800004,//当前有功需量
	0x02800005,//当前无功需量
	0x02800006,//当前视在需量
	0x02800007,//表内温度

//4事件记录

//5参变量数据

//6冻结数据
	0x050003FF,//定时冻结组合无功1电能数据
	0x050004FF,//定时冻结组合无功2电能数据
	0x050103FF,//瞬时冻结组合无功1电能数据
	0x050104FF,//瞬时冻结组合无功2电能数据
	0x050203FF,//两套时区表切换组合无功1电能数据
	0x050204FF,//两套时区表切换组合无功2电能数据
	0x050303FF,//两套日时段表切换组合无功1电能数据
	0x050304FF,//两套日时段表切换组合无功2电能数据
	0x05061001,//日冻结有功无功功率(总/A/B/C有功功率,总/A/B/C无功功率)

//7负荷记录数据
};

u32 signed_DL2007_DI(u32 PORTn)//DL/T-2007数据带有正负符号的数据标识;入口:UARTCtrl->RM_DI;返回:0=没符号，1=有符号
{
	u32 i;
	u32 x;
	u32 RMDI32;
	u32 RMDI1;
	u32 RMDI0;
	UARTCtrl_TypeDef * UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	i=UARTCtrl->RM_DI;
	RMDI0=i&0xff;
	RMDI1=(i>>8)&0xff;
	RMDI32=(i>>16);
	for(i=0;i<(sizeof(signed_DL2007_List)/4);i++)
	{
		x=signed_DL2007_List[i];
		x>>=16;
		if(RMDI32==x)
		{
			x=signed_DL2007_List[i];
			x>>=8;
			x&=0xff;
			if((x==0xff)||(x==RMDI1))
			{
				x=signed_DL2007_List[i];
				x&=0xff;
				if((x==0xff)||(x==RMDI0))
				{
					return 1;
				}
			}
		}
	}
	return 0;
}


//UART抄表数据缓冲定义
//#define LEN_RM_DI_CSD     512
//抄表数据缓冲1,最大总长度=LEN_RM_DI_CSD
//0 6byte 电能表地址
//6 2byte 长度=时标+已采集的CSD(不包括本身2字节)

//8 7byte 采集启动时标  date_time_s(无数据类型)
//15 7byte 采集成功时标  date_time_s(无数据类型)
//22 7byte 采集存储时标  date_time_s(无数据类型)
//29  采集的CSD  array CSD(有数据类型)

//抄表数据缓冲2,最大总长度=LEN_UARTnFnDataBuff-LEN_RM_DI_CSD
//LEN_RM_DI_CSD   2byte 长度=已填写入buff但还没完整一个CSD的数据长度(不包括本身2字节)
//LEN_RM_DI_CSD+2 2byte 长度=已填写入buff完整CSD的数据长度(不包括本身2字节)
//LEN_RM_DI_CSD+4 采集的数据(有数据类型)(ROAD时不写入总关联的OAD个数数组!!!)

u32 RM_RxDATA_DL2007(u32 PORTn)//抄表接收数据处理:返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
{
	u32 i;
	u32 n;
	u32 OI;
	u32 Data;
	u32 LEN_Rx;
	u32 LEN_RxDataBuff;
	u32 LEN_Data0;
	u32 LEN_Data1;
	u32 signedDI;
	u8* p8Array;
	u8* p8Data;
	u16* p16Data;
	u8* p8rx;
	UARTCtrl_TypeDef * UARTCtrl;
	u32 offset;
	#if(USER/100)==15//安徽
	u32 s;
	#endif
	
