gdgly/NUC97X_JS/STM32F4xx/DL698/RM_RxDATA_DL2007.cpp
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	LEN_RxDataBuff=Get_LEN_UARTnFnDataBuff(PORTn);//得到UART抄表数据缓冲长度
	LEN_RxDataBuff-=(LEN_RM_DI_CSD+4);
	p8Data=(u8 *)Get_ADDR_UARTnFnDataBuff(PORTn);
	p16Data=(u16*)(p8Data+LEN_RM_DI_CSD);
	LEN_Data1=p16Data[1];
	if(LEN_RxDataBuff<LEN_Data1)
	{//错
		return 3;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
	}
	LEN_RxDataBuff-=LEN_Data1;
	p8Data+=LEN_RM_DI_CSD+4+LEN_Data1;
	p8Array=(u8*)p8Data;
	if(UARTCtrl->RMCSDSubCount==0)//抄表CSD子计数(非DL698抄表时)
	{
		p16Data[0]=0;//已填写入buff但还没完整一个CSD的数据长度(不包括本身2字节)
	}
	LEN_Data0=p16Data[0];
	if(LEN_RxDataBuff<LEN_Data0)
	{//错
		return 1;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
	}
	LEN_RxDataBuff-=LEN_Data0;

	//无数据(空数据)
	if(UARTCtrl->RM_Rx_date_NULL!=0)//抄表接收返回:0=有数据,!=0无数据(空数据)
	{
//		if(UARTCtrl->RMCSD[1]==0)
//		{//OAD
//			LEN_Rx=1;
//		}
//		else
//		{//ROAD
//			LEN_Rx=UARTCtrl->RMCSD[6];
//		}	
//		if(LEN_RxDataBuff<LEN_Rx)
//		{//缓冲长度不够
//			return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
//		}
//		for(i=0;i<LEN_Rx;i++)
//		{
//			p8Data[i]=0;
//		}
//		p16Data[0]=LEN_Rx;
		UARTCtrl->RMCSDSubCount=UARTCtrl->RMCSDSubCountMax;
		UARTCtrl->RMROADCount=UARTCtrl->RMROADCountMax;
		return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
	}
	if(PORTn==ACSAMPLEPORT)
	{
		p8rx=(u8 *)Get_ADDR_UARTnTx(PORTn);
	}else
	{
		p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
	}
	
	LEN_Rx=p8rx[9];
	# if(USER/100)==15//安徽
	if(LEN_Rx<4)
	{//长度<4
		return 0;
	}
	if(LEN_Rx==4)
	{//长度==4，表示空数据
		if(UARTCtrl->RMCSD[1]==0)
		{//OAD
			LEN_Rx=1;
		}
		else
		{//ROAD
			LEN_Rx=UARTCtrl->RMCSD[6];
		}	
		if(LEN_RxDataBuff<LEN_Rx)
		{//缓冲长度不够
			return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
		}
		for(i=0;i<LEN_Rx;i++)
		{
			p8Data[i]=0;
		}
		p16Data[0]=LEN_Rx;
		UARTCtrl->RMCSDSubCount=UARTCtrl->RMCSDSubCountMax;
		UARTCtrl->RMROADCount=UARTCtrl->RMROADCountMax;
		return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
	}
	#else
	if(LEN_Rx<=4)
	{//长度<4
		return 0;
	}
	#endif
	
//---后续帧---
	if((PORTn==RS485_1PORT)||(PORTn==RS485_2PORT))
	{//后续帧标志
		if(UARTCtrl->RM_SubsequentFrames==0)//0=无读后续帧,1-n=读续帧的帧号
		{//非后续帧
			if(p8rx[8]&0x20)
			{//有后续帧
			#if EnMeterAutoReportEvent==1//允许电能表主动上报事件:0=不允许,1=允许
				UARTCtrl->RM_SubsequentFrames++;//0=无读后续帧,1-n=读续帧的帧号
			#endif
			}
		}
		else
		{
			UARTCtrl->RM_SubsequentFrames=0;//0=无读后续帧,1-n=读续帧的帧号
			//后续帧数据处理
			
			return 0;
		}
	}
//---后续帧结束---
	
//---曲线开始---
	OI=p8rx[10+0]|(p8rx[10+1]<<8)|(p8rx[10+2]<<16)|(p8rx[10+3]<<24);
	switch(OI)
	{
		case 0x06000001://全部6类负荷曲线
	#if (USER/100)==15//安徽
		case 0x060000FF://全部6类负荷曲线(安徽)
	#endif
//负荷记录起始码：A0H，A0H（或 E0H，E0H：本数据块不正确），2 字节； 
//负荷记录字节数：1 字节（十六进制）； 
//负荷记录存储时间：年、月、日、时、分,  5 字节；
		
//电压、电流、频率：17 字节； 
//块分隔码：AAH，1 字节； 
//有、无功功率：24 字节； 
//块分隔码：AAH，1 字节； 
//功率因数：8 字节； 
//块分隔码：AAH，1 字节； 
//有、无功总电能：16 字节； 
//块分隔码：AAH，1 字节； 
//四象限无功总电能：16 字节；
//块分隔码：AAH，1 字节；
//当前需量：6 字节； 
//块分隔码：AAH，1 字节；
//负荷记录累加校验码：1 字节（从第一个 A0H 开始到最后一个数据块结束码）；
//负荷记录结束码：E5H,1 字节。
			break;
		case 0x06010001://1类负荷曲线(电压、电流、频率)
			break;
		case 0x06020001://2类负荷曲线(有无功功率)
			if(p8rx[14+8]!=0xAA)
			{//前面无分隔符AA
				MR(ADDR_DATABUFF,(u32)p8rx+14+8,25);
				p8rx[9]+=1;
				p8rx[14+8]=0xAA;
				MW(ADDR_DATABUFF,(u32)p8rx+14+8+1,25);
			}
			break;
		case 0x06030001://3类负荷曲线(功率因数)
			if(p8rx[14+8]!=0xAA)
			{//前面无分隔符AA
				MR(ADDR_DATABUFF,(u32)p8rx+14+8,9);
				p8rx[9]+=2;
				p8rx[14+8]=0xAA;
				p8rx[14+9]=0xAA;
				MW(ADDR_DATABUFF,(u32)p8rx+14+8+2,9);
			}
			break;
		case 0x06040001://4类负荷曲线(正反有功,組合无功1和2总电能)
			if(p8rx[14+8]!=0xAA)
			{//前面无分隔符AA
				MR(ADDR_DATABUFF,(u32)p8rx+14+8,17);
				p8rx[9]+=3;
				p8rx[14+8]=0xAA;
				p8rx[14+9]=0xAA;
				p8rx[14+10]=0xAA;
				MW(ADDR_DATABUFF,(u32)p8rx+14+8+3,17);
			}
			break;
		case 0x06050001://5类负荷曲线(1-4象限无功总电能)
			if(p8rx[14+8]!=0xAA)
			{//前面无分隔符AA
				MR(ADDR_DATABUFF,(u32)p8rx+14+8,17);
				p8rx[9]+=4;
				p8rx[14+8]=0xAA;
				p8rx[14+9]=0xAA;
				p8rx[14+10]=0xAA;
				p8rx[14+11]=0xAA;
				MW(ADDR_DATABUFF,(u32)p8rx+14+8+4,17);
			}
			break;
		case 0x06060001://6类负荷曲线(当前有功需量,当前无功需量)
			if(p8rx[14+8]!=0xAA)
			{//前面无分隔符AA
				MR(ADDR_DATABUFF,(u32)p8rx+14+8,7);
				p8rx[9]+=5;
				p8rx[14+8]=0xAA;
				p8rx[14+9]=0xAA;
				p8rx[14+10]=0xAA;
				p8rx[14+11]=0xAA;
				p8rx[14+12]=0xAA;
				MW(ADDR_DATABUFF,(u32)p8rx+14+8+5,7);
			}
			break;
		default:
			OI=0;
			break;
	}
	if(OI)
	{//是曲线
		if(UARTCtrl->RMCSD[1]==0)
		{//非ROAD错
			return 4;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
		}
		LEN_Rx=p8rx[9];
		if(LEN_Rx<(4+8))
		{
			return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
		}
		p8Data+=LEN_Data0;
		for(n=0;n<UARTCtrl->RMCSD[6];n++)
		{
			offset=4+8;
			p8Array=(u8*)p8Data;
			OI=(UARTCtrl->RMCSD[7+(4*n)]<<24)|(UARTCtrl->RMCSD[7+(4*n)+1]<<16)|(UARTCtrl->RMCSD[7+(4*n)+2]<<8)|(UARTCtrl->RMCSD[7+(4*n)+3]<<0);
			switch(OI)
			{//方案里是”00100201“和”00200201“，主站用”00100200“和”00200200“召读，费率电量可以是空，只把总电量返回就行了
				case 0x00100201://正向有功电能总
				case 0x00200201://反向有功电能总
				case 0x00300201://组合无功1电能总
				case 0x00400201://组合无功2电能总
				case 0x00500201://第1象限无功电能总
				case 0x00600201://第2象限无功电能总
				case 0x00700201://第3象限无功电能总
				case 0x00800201://第4象限无功电能总
				case 0x20000201://A相电压
				case 0x20010201://A相电流
				case 0x20040202://A相有功功率
				case 0x20050202://A相无功功率
				case 0x200A0202://A相功率因数
					UARTCtrl->RMCSD[7+(4*n)+3]=0;
					break;
			}
			if(OI==0x20010400)
			{//零线电流，645表曲线冻中无零线电流
				if(LEN_RxDataBuff<1)
				{//缓冲长度不够
					return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
				}
				p8Data[0]=0;
				p8Data+=1;
				LEN_Data0+=1;
				LEN_RxDataBuff-=1;
				continue;
			}
			OI>>=16;
			switch(OI)
			{
				case 0x2021://冻结时标
					if(LEN_RxDataBuff<8)
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Data[0]=DataType_date_time_s;
					i=p8rx[14+7];//年
					i=bcd_hex(i);
					i+=2000;
					p8Data[1]=i>>8;
					p8Data[2]=i;
					i=p8rx[14+6];//月
					i=bcd_hex(i);
					p8Data[3]=i;
					i=p8rx[14+5];//日
					i=bcd_hex(i);
					p8Data[4]=i;
					i=p8rx[14+4];//时
					i=bcd_hex(i);
					p8Data[5]=i;
					i=p8rx[14+3];//分
					i=bcd_hex(i);
					p8Data[6]=i;
					p8Data[7]=0;//秒
					p8Data+=8;
					LEN_Data0+=8;
					LEN_RxDataBuff-=8;
					break;
				case 0x2000://电压
				case 0x2001://电流
				case 0x200f://电网频率
			//电压、电流、频率：17 字节； 
			//块分隔码：AAH，1 字节；
					if((LEN_Rx<(offset+17))||(p8rx[10+offset]==0xaa))
					{
						if(LEN_RxDataBuff<1)
						{//缓冲长度不够
							return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
						}
						p8Data[0]=0;
						p8Data+=1;
						LEN_Data0+=1;
						LEN_RxDataBuff-=1;
						break;
					}
					switch(OI)
					{
						case 0x2000://电压
							//DL2007数据格式:XXX.X
							if(LEN_RxDataBuff<(2+(3*3)))
							{//缓冲长度不够
								return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
							}
							
