gdgly/NUC97X_JS/STM32F4xx/DL698/RM_RxDATA_DL2007.cpp
							p8Array[0]=DataType_array;
							p8Array[1]=0;
							p8Data+=2;
							LEN_Data0+=2;
							LEN_RxDataBuff-=2;
							for(i=0;i<3;i++)
							{
								Data=p8rx[10+offset]|(p8rx[10+offset+1]<<8);
								if(Data==0xffff)
								{
									offset+=2;
									continue;
								}
								Data=bcd_hex(Data);
								p8Data[0]=DataType_long_unsigned;
								p8Data[1]=Data>>8;
								p8Data[2]=Data;
								offset+=2;
								p8Data+=3;
								LEN_Data0+=3;
								LEN_RxDataBuff-=3;
								p8Array[1]++;//增加数组数
							}
							break;
						case 0x2001://电流
							offset+=6;
							//DL2007数据格式:XXX.XXX
							if(LEN_RxDataBuff<(2+(3*5)))
							{//缓冲长度不够
								return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
							}
							p8Array[0]=DataType_array;
							p8Array[1]=0;
							p8Data+=2;
							LEN_Data0+=2;
							LEN_RxDataBuff-=2;
							for(i=0;i<3;i++)
							{
								Data=p8rx[10+offset]|(p8rx[10+offset+1]<<8)|(p8rx[10+offset+2]<<16);
								if(Data==0xffffff)
								{
									offset+=3;
									continue;
								}
								if(Data>>23)
								{//负
									Data<<=9;
									Data>>=9;
									Data=bcd_hex(Data);
									Data=~Data;
									Data+=1;
								}
								else
								{
									Data=bcd_hex(Data);
								}
								p8Data[0]=DataType_double_long;
								p8Data[1]=Data>>24;
								p8Data[2]=Data>>16;
								p8Data[3]=Data>>8;
								p8Data[4]=Data>>0;
								offset+=3;
								p8Data+=5;
								LEN_Data0+=5;
								LEN_RxDataBuff-=5;
								p8Array[1]++;//增加数组数
							}
							break;
						case 0x200f://电网频率(数据类型：long-unsigned，单位：Hz，换算：-2)
							offset+=6+9;
							//DL2007数据格式:XXX.XXX
							if(LEN_RxDataBuff<3)
							{//缓冲长度不够
								return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
							}
							Data=p8rx[10+offset]|(p8rx[10+offset+1]<<8);
							if(Data==0xffff)
							{
								p8Data[0]=0;
								p8Data+=1;
								LEN_Data0+=1;
								LEN_RxDataBuff-=1;
								break;
							}
							Data=bcd_hex(Data);
							p8Data[0]=DataType_long_unsigned;
							p8Data[1]=Data>>8;
							p8Data[2]=Data;
							offset+=2;
							p8Data+=3;
							LEN_Data0+=3;
							LEN_RxDataBuff-=3;
							break;
					}
					break;
				case 0x2004://有功功率
				case 0x2005://无功功率
			//有、无功功率：24 字节
			//块分隔码：AAH，1 字节
					if(p8rx[10+offset]==0xaa)
					{
						offset+=1;
					}
					else
					{
						offset+=17+1;
					}
					if((LEN_Rx<(offset+24))||(p8rx[10+offset]==0xaa))
					{
						if(LEN_RxDataBuff<1)
						{//缓冲长度不够
							return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
						}
						p8Data[0]=0;
						p8Data+=1;
						LEN_Data0+=1;
						LEN_RxDataBuff-=1;
						break;
					}
					switch(OI)
					{
						case 0x2005://无功功率
							offset+=12;
						case 0x2004://有功功率
							if(LEN_RxDataBuff<(2+(4*5)))
							{//缓冲长度不够
								return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
							}
							p8Array[0]=DataType_array;
							p8Array[1]=0;
							p8Data+=2;
							LEN_Data0+=2;
							LEN_RxDataBuff-=2;
							for(i=0;i<4;i++)
							{
								Data=p8rx[10+offset]|(p8rx[10+offset+1]<<8)|(p8rx[10+offset+2]<<16);
								if(Data==0xffffff)
								{
									offset+=3;
									continue;
								}
								if(Data>>23)
								{//负
									Data<<=9;
									Data>>=9;
									Data=bcd_hex(Data);
									Data=~Data;
									Data+=1;
								}
								else
								{
									Data=bcd_hex(Data);
								}
								p8Data[0]=DataType_double_long;
								p8Data[1]=Data>>24;
								p8Data[2]=Data>>16;
								p8Data[3]=Data>>8;
								p8Data[4]=Data>>0;
								offset+=3;
								p8Data+=5;
								LEN_Data0+=5;
								LEN_RxDataBuff-=5;
								p8Array[1]++;//增加数组数
							}
							break;
					}
					break;
				case 0x200a://功率因数
			//功率因数：8 字节
			//块分隔码：AAH，1 字节
					if(p8rx[10+offset]==0xaa)
					{
						offset+=1;
					}
					else
					{
						offset+=17+1;
					}
					if(p8rx[10+offset]==0xaa)
					{
						offset+=1;
					}
					else
					{
						offset+=24+1;
					}
					if((LEN_Rx<(offset+8))||(p8rx[10+offset]==0xaa))
					{
						if(LEN_RxDataBuff<1)
						{//缓冲长度不够
							return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
						}
						p8Data[0]=0;
						p8Data+=1;
						LEN_Data0+=1;
						LEN_RxDataBuff-=1;
						break;
					}
					if(LEN_RxDataBuff<(2+(4*3)))
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Array[0]=DataType_array;
					p8Array[1]=0;
					p8Data+=2;
					LEN_Data0+=2;
					LEN_RxDataBuff-=2;
					for(i=0;i<4;i++)
					{
						Data=p8rx[10+offset]|(p8rx[10+offset+1]<<8);
						if(Data==0xffff)
						{
							offset+=2;
							continue;
						}
						if(Data>>15)
						{//负
							Data<<=17;
							Data>>=17;
							Data=bcd_hex(Data);
							Data=~Data;
							Data+=1;
						}
						else
						{
							Data=bcd_hex(Data);
						}
						p8Data[0]=DataType_long;
						p8Data[1]=Data>>8;
						p8Data[2]=Data;
						offset+=2;
						p8Data+=3;
						LEN_Data0+=3;
						LEN_RxDataBuff-=3;
						p8Array[1]++;//增加数组数
					}
					break;
				case 0x0010://正向有功电能
				case 0x0020://反向有功电能
				case 0x0030://组合无功1电能
				case 0x0040://组合无功2电能
			//有、无功总电能：16 字节
			//块分隔码：AAH，1 字节
					if(p8rx[10+offset]==0xaa)
					{
						offset+=1;
					}
					else
					{
						offset+=17+1;
					}
					if(p8rx[10+offset]==0xaa)
					{
						offset+=1;
					}
					else
					{
						offset+=24+1;
					}
					if(p8rx[10+offset]==0xaa)
					{
						offset+=1;
					}
					else
					{
						offset+=8+1;
					}
					if((LEN_Rx<(offset+16))||(p8rx[10+offset]==0xaa))
					{
						if(LEN_RxDataBuff<1)
						{//缓冲长度不够
							return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
						}
						p8Data[0]=0;
						p8Data+=1;
						LEN_Data0+=1;
						LEN_RxDataBuff-=1;
						break;
					}
					switch(OI)
					{
						case 0x0020://反向有功电能
							offset+=4;
						case 0x0010://正向有功电能
							if(LEN_RxDataBuff<(2+5+4))
							{//缓冲长度不够
								return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
							}
							p8Array[0]=DataType_array;
							p8Array[1]=5;
							p8Data+=2;
							LEN_Data0+=2;
							LEN_RxDataBuff-=2;
							Data=p8rx[10+offset]|(p8rx[10+offset+1]<<8)|(p8rx[10+offset+2]<<16)|(p8rx[10+offset+3]<<24);
							Data=bcd_hex(Data);
							p8Data[0]=DataType_double_long_unsigned;
							p8Data[1]=Data>>24;
							p8Data[2]=Data>>16;
							p8Data[3]=Data>>8;
							p8Data[4]=Data>>0;
							p8Data[5]=0;//费率1
							p8Data[6]=0;//费率2
							p8Data[7]=0;//费率3
							p8Data[8]=0;//费率4
							p8Data+=5+4;
							LEN_Data0+=5+4;
							LEN_RxDataBuff-=5+4;
							break;
						case 0x0040://组合无功2电能
							offset+=4;
						case 0x0030://组合无功1电能
							offset+=8;
							if(LEN_RxDataBuff<(2+5+4))
							{//缓冲长度不够
								return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
							}
							p8Array[0]=DataType_array;
							p8Array[1]=5;
							p8Data+=2;
							LEN_Data0+=2;
							LEN_RxDataBuff-=2;
							Data=p8rx[10+offset]|(p8rx[10+offset+1]<<8)|(p8rx[10+offset+2]<<16)|(p8rx[10+offset+3]<<24);
							if(Data>>31)
							{//负
								Data<<=1;
								Data>>=1;
								Data=bcd_hex(Data);
								Data=~Data;
								Data+=1;
							}
							else
							{
								Data=bcd_hex(Data);
							}
							p8Data[0]=DataType_double_long;
							p8Data[1]=Data>>24;
							p8Data[2]=Data>>16;
							p8Data[3]=Data>>8;
							p8Data[4]=Data>>0;
							p8Data[5]=0;//费率1
							p8Data[6]=0;//费率2
							p8Data[7]=0;//费率3
							p8Data[8]=0;//费率4
							p8Data+=5+4;
							LEN_Data0+=5+4;
							LEN_RxDataBuff-=5+4;
							break;
					}
					break;
				case 0x0050://第1象限无功电能
				case 0x0060://第2象限无功电能
				case 0x0070://第3象限无功电能
				case 0x0080://第4象限无功电能
			//四象限无功总电能：16 字节
			//块分隔码：AAH，1 字节
					if(p8rx[10+offset]==0xaa)
					{
						offset+=1;
					}
					else
					{
						offset+=17+1;
					}
					if(p8rx[10+offset]==0xaa)
					{
						offset+=1;
					}
					else
					{
						offset+=24+1;
					}
					if(p8rx[10+offset]==0xaa)
					{
						offset+=1;
					}
					else
					{
						offset+=8+1;
					}
					if(p8rx[10+offset]==0xaa)
					{
						offset+=1;
					}
					else
					{
						offset+=16+1;
					}
					if((LEN_Rx<(offset+16))||(p8rx[10+offset]==0xaa))
					{
						if(LEN_RxDataBuff<1)
						{//缓冲长度不够
							return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
						}
						p8Data[0]=0;
						p8Data+=1;
						LEN_Data0+=1;
						LEN_RxDataBuff-=1;
						break;
					}
					switch(OI)
					{
						case 0x0080://第4象限无功电能
							offset+=4;
						case 0x0070://第3象限无功电能
							offset+=4;
						case 0x0060://第2象限无功电能
							offset+=4;
						case 0x0050://第1象限无功电能
							if(LEN_RxDataBuff<(2+5+4))
							{//缓冲长度不够
								return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
							}
							p8Array[0]=DataType_array;
							p8Array[1]=5;
							p8Data+=2;
							LEN_Data0+=2;
							LEN_RxDataBuff-=2;
							Data=p8rx[10+offset]|(p8rx[10+offset+1]<<8)|(p8rx[10+offset+2]<<16)|(p8rx[10+offset+3]<<24);
							Data=bcd_hex(Data);
							p8Data[0]=DataType_double_long_unsigned;
							p8Data[1]=Data>>24;
							p8Data[2]=Data>>16;
							p8Data[3]=Data>>8;
							p8Data[4]=Data>>0;
							p8Data[5]=0;//费率1
							p8Data[6]=0;//费率2
							p8Data[7]=0;//费率3
							p8Data[8]=0;//费率4
							p8Data+=5+4;
							LEN_Data0+=5+4;
							LEN_RxDataBuff-=5+4;
							break;
					}
					break;
				case 0x2017://当前有功需量
				case 0x2018://当前无功需量
			//当前需量：6 字节
			//块分隔码：AAH，1 字节
					if(p8rx[10+offset]==0xaa)
					{
						offset+=1;
					}
					else
					{
						offset+=17+1;
					}
					if(p8rx[10+offset]==0xaa)
					{
						offset+=1;
					}
					else
					{
						offset+=24+1;
					}
					if(p8rx[10+offset]==0xaa)
					{
						offset+=1;
					}
					else
					{
						offset+=8+1;
					}
					if(p8rx[10+offset]==0xaa)
					{
						offset+=1;
					}
					else
					{
						offset+=16+1;
					}
					if(p8rx[10+offset]==0xaa)
					{
						offset+=1;
					}
					else
					{
						offset+=16+1;
					}
					if((LEN_Rx<(offset+6))||(p8rx[10+offset]==0xaa))
					{
						if(LEN_RxDataBuff<1)
						{//缓冲长度不够
							return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
						}
						p8Data[0]=0;
						p8Data+=1;
						LEN_Data0+=1;
						LEN_RxDataBuff-=1;
						break;
					}
					switch(OI)
					{
						case 0x2018://当前无功需量
							offset+=3;
						case 0x2017://当前有功需量
							if(LEN_RxDataBuff<5)
							{//缓冲长度不够
								return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
							}
							Data=p8rx[10+offset]|(p8rx[10+offset+1]<<8)|(p8rx[10+offset+2]<<16);
							if(Data==0xffffff)
							{
								p8Data[0]=0;
								p8Data+=1;
								LEN_Data0+=1;
								LEN_RxDataBuff-=1;
								break;
							}
							Data=bcd_hex(Data);
							p8Data[0]=DataType_double_long_unsigned;
							p8Data[1]=Data>>24;
							p8Data[2]=Data>>16;
							p8Data[3]=Data>>8;
							p8Data[4]=Data>>0;
							p8Data+=5;
							LEN_Data0+=5;
							LEN_RxDataBuff-=5;
							break;
					}
					break;
				default:
					if(LEN_RxDataBuff<1)
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Data[0]=0;
					p8Data+=1;
					LEN_Data0+=1;
					LEN_RxDataBuff-=1;
					break;
			}
		}
		p16Data[0]=LEN_Data0;
		return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
	}
	
