gdgly/NUC97X_JS/STM32F4xx/DL698/RM_RxDATA_DL2007.cpp
//用实时数据冻结为曲线
	i=UARTCtrl->RMCSD[1];
	if(i)
	{//ROAD
		OI=UARTCtrl->RMCSD[2+0]<<24;
		OI|=UARTCtrl->RMCSD[2+1]<<16;
		OI|=UARTCtrl->RMCSD[2+2]<<8;
		OI|=UARTCtrl->RMCSD[2+3];
	#if(USER/100)==17//江苏系
		if((OI==0x50020200)||(OI==0x50050200))
	#else
		if(OI==0x50020200)
	#endif
		{//分钟冻结
			p8Data+=LEN_Data0;
			p8Array=(u8*)p8Data;
			LEN_Rx-=4;
			p8rx+=14;
			n=UARTCtrl->RMROADCount;//抄表CSD的ROAD内OAD计数(非DL698抄表时)
			OI=(UARTCtrl->RMCSD[7+(4*n)+0]<<24)+(UARTCtrl->RMCSD[7+(4*n)+1]<<16)+(UARTCtrl->RMCSD[7+(4*n)+2]<<8)+(UARTCtrl->RMCSD[7+(4*n)+3]<<0);
			switch(OI)
			{//方案里是”00100201“和”00200201“，主站用”00100200“和”00200200“召读，费率电量可以是空，只把总电量返回就行了
				case 0x00100201://正向有功电能总
				case 0x00200201://反向有功电能总
				case 0x00300201://组合无功1电能总
				case 0x00400201://组合无功2电能总
				case 0x00500201://第1象限无功电能总
				case 0x00600201://第2象限无功电能总
				case 0x00700201://第3象限无功电能总
				case 0x00800201://第4象限无功电能总
				case 0x20000201://A相电压
				case 0x20010201://A相电流
				case 0x20040202://A相有功功率
				case 0x20050202://A相无功功率
				case 0x200A0202://A相功率因数
					UARTCtrl->RMCSD[7+(4*n)+3]=0;
					break;
			}
			switch(OI)
			{
				case 0x20210200://冻结时标
					if(LEN_RxDataBuff<8)
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Data[0]=DataType_date_time_s;
					Get_date_time_s(p8Data+1);//得到date_time_s共7字节
					p8Data+=8;
					LEN_Data0+=8;
					LEN_RxDataBuff-=8;
					break;
					
			#if(USER/100)==17//???
				case 0x10100200:
				case 0x10300200:
					signedDI=signed_DL2007_DI(PORTn);
					LEN_Rx/=8;
					if(LEN_RxDataBuff<(2+(5*LEN_Rx)))
					{//??????
						return 2;//??:????0=??,1=??1????,2=??2????,3=?????????,4=???????,5=?????127,6=?????????
					}
					p8Array[0]=DataType_array;
					p8Array[1]=0;
					LEN_Data0=2;
					LEN_RxDataBuff-=2;
					p8Data+=LEN_Data0;
					for(i=0;i<LEN_Rx;i++)
					{
						//?
						Data=p8rx[0]|(p8rx[1]<<8)|(p8rx[2]<<16);
						if(Data==0xffffff)
						{//?
							p8rx+=8;
							continue;
						}
						p8Data[0]=DataType_structure;
						p8Data[1]=2;
						p8Data+=2;
						if(signedDI==0)
						{
							p8Data[0]=DataType_double_long_unsigned;
							Data=bcd_hex(Data);
						}
						else
						{
							p8Data[0]=DataType_double_long;
							if(Data>>23)
							{//?
								Data<<=9;
								Data>>=9;
								Data=bcd_hex(Data);
								Data=~Data;
								Data+=1;
							}
							else
							{
								Data=bcd_hex(Data);
							}
						}
						p8Data[1]=Data>>24;
						p8Data[2]=Data>>16;
						p8Data[3]=Data>>8;
						p8Data[4]=Data>>0;
						p8rx+=3;
						p8Data+=5;
						//????
						p8Data[0]=DataType_date_time_s;
						Data=p8rx[4];//?
						Data=bcd_hex(Data);
						Data+=2000;
						p8Data[1]=Data>>8;
						p8Data[2]=Data;
						Data=p8rx[3];//?
						Data=bcd_hex(Data);
						p8Data[3]=Data;
						Data=p8rx[2];//?
						Data=bcd_hex(Data);
						p8Data[4]=Data;
						Data=p8rx[1];//?
						Data=bcd_hex(Data);
						p8Data[5]=Data;
						Data=p8rx[0];//?
						Data=bcd_hex(Data);
						p8Data[6]=Data;
						p8Data[7]=0;//?
						p8rx+=5;
						p8Data+=8;
						
						LEN_Data0+=2+5+8;;
						if(p8Array[1]>=127)
						{
							return 5;//??:????0=??,1=??1????,2=??2????,3=?????????,4=???????,5=?????127,6=?????????
						}
						p8Array[1]++;//?????
					}
					p16Data[0]=LEN_Data0;
					break;
			case 0x00100200://??????
			case 0x00200200://??????
			case 0x00500200://???????
			case 0x00600200://???????
			case 0x00700200://???????
			case 0x00800200://???????
		#endif
				case 0x00100201://正向有功总电能
				case 0x00200201://反向有功总电能
				case 0x00500201://一象限无功总电能
				case 0x00600201://二象限无功总电能
				case 0x00700201://三象限无功总电能
				case 0x00800201://四象限无功总电能
					LEN_Rx/=4;
					if(LEN_RxDataBuff<(2+(5*LEN_Rx)))
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Array[0]=DataType_array;
					p8Array[1]=LEN_Rx;
					p8Data+=2;
					LEN_Data0+=2;
					LEN_RxDataBuff-=2;
					for(i=0;i<LEN_Rx;i++)
					{
						Data=p8rx[0]|(p8rx[1]<<8)|(p8rx[2]<<16)|(p8rx[3]<<24);
						signedDI=0;
						if(signedDI==0)
						{
							p8Data[0]=DataType_double_long_unsigned;
							Data=bcd_hex(Data);
						}
						else
						{
							p8Data[0]=DataType_double_long;
							if(Data>>31)
							{//负
								Data<<=1;
								Data>>=1;
								Data=bcd_hex(Data);
								Data=~Data;
								Data+=1;
							}
							else
							{
								Data=bcd_hex(Data);
							}
						}
						p8Data[1]=Data>>24;
						p8Data[2]=Data>>16;
						p8Data[3]=Data>>8;
						p8Data[4]=Data>>0;
						p8Data+=5;
						LEN_Data0+=5;
						LEN_RxDataBuff-=5;
						p8rx+=4;
					}
					if(LEN_Rx==1)
					{
						if(LEN_RxDataBuff<4)
						{//缓冲长度不够
							return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
						}
						p8Array[1]=5;//数组数
						p8Data[0]=0;//费率1
						p8Data[1]=0;//费率2
						p8Data[2]=0;//费率3
						p8Data[3]=0;//费率4
						p8Data+=4;
						LEN_Data0+=4;
						LEN_RxDataBuff-=4;
					}
					break;
				case 0x00300200://组合无功1电能
				case 0x00400200://组合无功2电能
					LEN_Rx/=4;
					if(LEN_RxDataBuff<(2+(5*LEN_Rx)))
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Array[0]=DataType_array;
					p8Array[1]=LEN_Rx;
					p8Data+=2;
					LEN_Data0+=2;
					LEN_RxDataBuff-=2;
					for(i=0;i<LEN_Rx;i++)
					{
						Data=p8rx[0]|(p8rx[1]<<8)|(p8rx[2]<<16)|(p8rx[3]<<24);
						signedDI=1;
						if(signedDI==0)
						{
							p8Data[0]=DataType_double_long_unsigned;
							Data=bcd_hex(Data);
						}
						else
						{
							p8Data[0]=DataType_double_long;
							if(Data>>31)
							{//负
								Data<<=1;
								Data>>=1;
								Data=bcd_hex(Data);
								Data=~Data;
								Data+=1;
							}
							else
							{
								Data=bcd_hex(Data);
							}
						}
						p8Data[1]=Data>>24;
						p8Data[2]=Data>>16;
						p8Data[3]=Data>>8;
						p8Data[4]=Data>>0;
						p8Data+=5;
						LEN_Data0+=5;
						LEN_RxDataBuff-=5;
						p8rx+=4;
					}
					if(LEN_Rx==1)
					{
						if(LEN_RxDataBuff<4)
						{//缓冲长度不够
							return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
						}
						p8Array[1]=5;//数组数
						p8Data[0]=0;//费率1
						p8Data[1]=0;//费率2
						p8Data[2]=0;//费率3
						p8Data[3]=0;//费率4
						p8Data+=4;
						LEN_Data0+=4;
						LEN_RxDataBuff-=4;
					}
					break;
				case 0x20170200://当前有功需量
				case 0x20180200://当前无功需量
				//case 0x11100200://冻结周期内正向有功最大需量 
					if(LEN_RxDataBuff<5)
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					Data=p8rx[0]|(p8rx[1]<<8)|(p8rx[2]<<16);
					if(Data==0xffffff)
					{
						Data=0;
					}
					if(Data>>23)
					{//负
						Data<<=9;
						Data>>=9;
						Data=bcd_hex(Data);
						Data=~Data;
						Data+=1;
					}
					else
					{
						Data=bcd_hex(Data);
					}
					p8Data[0]=DataType_double_long;
					p8Data[1]=Data>>24;
					p8Data[2]=Data>>16;
					p8Data[3]=Data>>8;
					p8Data[4]=Data>>0;
					p8Data+=5;
					LEN_Data0+=5;
					LEN_RxDataBuff-=5;
					break;
				case 0x20000200://电压
					LEN_Rx/=2;
					if(LEN_RxDataBuff<(2+(3*LEN_Rx)))
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Array[0]=DataType_array;
					p8Array[1]=LEN_Rx;
					p8Data+=2;
					LEN_Data0+=2;
					LEN_RxDataBuff-=2;
					for(i=0;i<LEN_Rx;i++)
					{
						Data=p8rx[0]|(p8rx[1]<<8);
						if(Data==0xffff)
						{
							Data=0;
						}
						Data=bcd_hex(Data);
						p8Data[0]=DataType_long_unsigned;
						p8Data[1]=Data>>8;
						p8Data[2]=Data;
						p8Data+=3;
						LEN_Data0+=3;
						LEN_RxDataBuff-=3;
						p8rx+=2;
					}
					break;
				case 0x20010200://电流
					LEN_Rx/=3;
					if(LEN_RxDataBuff<(2+(5*LEN_Rx)))
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Array[0]=DataType_array;
					p8Array[1]=LEN_Rx;
					p8Data+=2;
					LEN_Data0+=2;
					LEN_RxDataBuff-=2;
					for(i=0;i<LEN_Rx;i++)
					{
						Data=p8rx[0]|(p8rx[1]<<8)|(p8rx[2]<<16);
						if(Data==0xffffff)
						{
							Data=0;
						}
						if(Data>>23)
						{//负
							Data<<=9;
							Data>>=9;
							Data=bcd_hex(Data);
							Data=~Data;
							Data+=1;
						}
						else
						{
							Data=bcd_hex(Data);
						}
						p8Data[0]=DataType_double_long;
						p8Data[1]=Data>>24;
						p8Data[2]=Data>>16;
						p8Data[3]=Data>>8;
						p8Data[4]=Data>>0;
						p8Data+=5;
						LEN_Data0+=5;
						LEN_RxDataBuff-=5;
						p8rx+=3;
					}
					break;
				case 0x20010400://零线电流
					//零线电流无数组
					Data=p8rx[0]|(p8rx[1]<<8)|(p8rx[2]<<16);
					if(Data==0xffffff)
					{
						Data=0;
					}
					if(Data>>23)
					{//负
						Data<<=9;
						Data>>=9;
						Data=bcd_hex(Data);
						Data=~Data;
						Data+=1;
					}
					else
					{
						Data=bcd_hex(Data);
					}
					p8Data[0]=DataType_double_long;
					p8Data[1]=Data>>24;
					p8Data[2]=Data>>16;
					p8Data[3]=Data>>8;
					p8Data[4]=Data>>0;
					p8Data+=5;
					LEN_Data0+=5;
					LEN_RxDataBuff-=5;
					break;
				case 0x20040200://有功功率
				case 0x20050200://无功功率
					LEN_Rx/=3;
					if(LEN_RxDataBuff<(2+(5*LEN_Rx)))
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Array[0]=DataType_array;
					p8Array[1]=LEN_Rx;
					p8Data+=2;
					LEN_Data0+=2;
					LEN_RxDataBuff-=2;
					for(i=0;i<LEN_Rx;i++)
					{
						Data=p8rx[0]|(p8rx[1]<<8)|(p8rx[2]<<16);
						if(Data==0xffffff)
						{
							Data=0;
						}
						if(Data>>23)
						{//负
							Data<<=9;
							Data>>=9;
							Data=bcd_hex(Data);
							Data=~Data;
							Data+=1;
						}
						else
						{
							Data=bcd_hex(Data);
						}
						p8Data[0]=DataType_double_long;
						p8Data[1]=Data>>24;
						p8Data[2]=Data>>16;
						p8Data[3]=Data>>8;
						p8Data[4]=Data>>0;
						p8Data+=5;
						LEN_Data0+=5;
						LEN_RxDataBuff-=5;
						p8rx+=3;
					}
					break;
				case 0x200A0200://功率因数
					LEN_Rx/=2;
					if(LEN_RxDataBuff<(2+(3*LEN_Rx)))
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Array[0]=DataType_array;
					p8Array[1]=LEN_Rx;
					p8Data+=2;
					LEN_Data0+=2;
					LEN_RxDataBuff-=2;
					for(i=0;i<LEN_Rx;i++)
					{
						Data=p8rx[0]|(p8rx[1]<<8);
						if(Data==0xffff)
						{
							Data=0;
						}
						if(Data>>15)
						{//负
							Data<<=17;
							Data>>=17;
							Data=bcd_hex(Data);
							Data=~Data;
							Data+=1;
						}
						else
						{
							Data=bcd_hex(Data);
						}
						p8Data[0]=DataType_long;
						p8Data[1]=Data>>8;
						p8Data[2]=Data;
						p8Data+=3;
						LEN_Data0+=3;
						LEN_RxDataBuff-=3;
						p8rx+=2;
					}
					break;
				case 0x20000201://A电压
					if(LEN_RxDataBuff<(2+3+2))
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Array[0]=DataType_array;
					p8Array[1]=3;
					p8Data+=2;
					LEN_Data0+=2;
					LEN_RxDataBuff-=2;
					Data=p8rx[0]|(p8rx[1]<<8);
					if(Data==0xffff)
					{
						Data=0;
					}
					Data=bcd_hex(Data);
					p8Data[0]=DataType_long_unsigned;
					p8Data[1]=Data>>8;
					p8Data[2]=Data;
					p8Data[3]=0;//B电压
					p8Data[4]=0;//C电压
					p8Data+=3+2;
					LEN_Data0+=3+2;
					LEN_RxDataBuff-=3+2;
					break;
				case 0x20010201://A电流
					if(LEN_RxDataBuff<(2+5+2))
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Array[0]=DataType_array;
					p8Array[1]=3;
					p8Data+=2;
					LEN_Data0+=2;
					LEN_RxDataBuff-=2;
					Data=p8rx[0]|(p8rx[1]<<8)|(p8rx[2]<<16);
					if(Data==0xffffff)
					{
						Data=0;
					}
					if(Data>>23)
					{//负
						Data<<=9;
						Data>>=9;
						Data=bcd_hex(Data);
						Data=~Data;
						Data+=1;
					}
					else
					{
						Data=bcd_hex(Data);
					}
					p8Data[0]=DataType_double_long;
					p8Data[1]=Data>>24;
					p8Data[2]=Data>>16;
					p8Data[3]=Data>>8;
					p8Data[4]=Data>>0;
					p8Data[5]=0;//B电流空
					p8Data[6]=0;//C电流空
					p8Data+=5+2;
					LEN_Data0+=5+2;
					LEN_RxDataBuff-=5+2;
					break;
				case 0x20040202://A相有功功率
				case 0x20050202://A相无功功率
					if(LEN_RxDataBuff<(2+5))
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Array[0]=DataType_array;
					p8Array[1]=1;
					p8Data+=2;
					LEN_Data0+=2;
					LEN_RxDataBuff-=2;
					Data=p8rx[0]|(p8rx[1]<<8)|(p8rx[2]<<16);
					if(Data==0xffffff)
					{
						Data=0;
					}
					if(Data>>23)
					{//负
						Data<<=9;
						Data>>=9;
						Data=bcd_hex(Data);
						Data=~Data;
						Data+=1;
					}
					else
					{
						Data=bcd_hex(Data);
					}
					p8Data[0]=DataType_double_long;
					p8Data[1]=Data>>24;
					p8Data[2]=Data>>16;
					p8Data[3]=Data>>8;
					p8Data[4]=Data>>0;
					p8Data+=5;
					LEN_Data0+=5;
					LEN_RxDataBuff-=5;
					break;
				case 0x200A0202://A相功率因数
					if(LEN_RxDataBuff<(2+3))
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Array[0]=DataType_array;
					p8Array[1]=1;
					p8Data+=2;
					LEN_Data0+=2;
					LEN_RxDataBuff-=2;
					Data=p8rx[0]|(p8rx[1]<<8);
					if(Data==0xffff)
					{
						Data=0;
					}
					if(Data>>15)
					{//负
						Data<<=17;
						Data>>=17;
						Data=bcd_hex(Data);
						Data=~Data;
						Data+=1;
					}
					else
					{
						Data=bcd_hex(Data);
					}
					p8Data[0]=DataType_long;
					p8Data[1]=Data>>8;
					p8Data[2]=Data;
					p8rx+=2;
					p8Data+=3;
					LEN_Data0+=3;
					LEN_RxDataBuff-=3;
					break;
				default:
					if(LEN_RxDataBuff<1)
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Data[0]=0;
					p8Data+=1;
					LEN_Data0+=1;
					LEN_RxDataBuff-=1;
					break;
			}
			p16Data[0]=LEN_Data0;
			return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
		}
	}
//---曲线结束---
	
