gdgly/NUC97X_JS/STM32F4xx/DL698/RM_RxDATA_DL2007.cpp
//---事件类开始---
	i=UARTCtrl->TaskID;
	//停上电事件固定任务号
	if(((i>>8)&0xff)==RMTASKnoPOWER)
	{
		//标准事件记录单元∷=structure
		//{
		//  事件记录序号  double-long-unsigned，
		//  事件发生时间  date_time_s，
		//  事件结束时间  date_time_s，
				
		//  事件发生源    instance-specific，
		//  事件上报状态  array 通道上报状态，
		//  第1个关联对象属性的数据  Data，
		//  …
		//  第n个关联对象属性的数据  Data
		//}
		if(LEN_RxDataBuff<23)
		{//缓冲长度不够
			return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
		}
		p8Data[0]=DataType_structure;
		p8Data[1]=3;
		//事件记录序号  double-long-unsigned
		p8Data[2]=DataType_double_long_unsigned;
		p8Data[3]=0;
		p8Data[4]=0;
		p8Data[5]=0;
		p8Data[6]=0;
		//事件发生时间  date_time_s
		//事件结束时间  date_time_s
		n=2;
		while(n--)
		{
			p8Data[7]=DataType_date_time_s;
			i=p8rx[14+5];//年
			i=bcd_hex(i);
			i+=2000;
			p8Data[8]=i>>8;
			p8Data[9]=i;
			i=p8rx[14+4];//月
			i=bcd_hex(i);
			p8Data[10]=i;
			i=p8rx[14+3];//日
			i=bcd_hex(i);
			p8Data[11]=i;
			i=p8rx[14+2];//时
			i=bcd_hex(i);
			p8Data[12]=i;
			i=p8rx[14+1];//分
			i=bcd_hex(i);
			p8Data[13]=i;
			i=p8rx[14+0];//秒
			i=bcd_hex(i);
			p8Data[14]=i;
			p8rx+=6;
			p8Data+=8;
		}
		LEN_Data0+=23;
		LEN_RxDataBuff-=23;
		p16Data[0]=LEN_Data0;
		return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
	}
	//全事件采集
	if(((i>>24)&0xf)==2)
	{//事件采集方案
	#if CompareMeterEventCount==1//全事件采集抄表是否比较发生次数:0=不比较(全部抄表数据写入文件),1=比较(只有次数变化的事件写入文件)
		if(UARTCtrl->RMCSDSubCount==0)//抄表CSD子计数(非DL698抄表时)
		{
			i=p8rx[14+0];//取事件次数
			i|=p8rx[14+1]<<8;
			i|=p8rx[14+2]<<16;
			i=bcd_hex(i);
//			i=Get_RxDATA_DL2007_MeterEventCount(PORTn);//从645读事件记录接收帧中取出电能表事件发生次数(事件记录序号);返回:hex发生次数,没找到时返回0xffffffff
//			if(i==0xffffffff)
//			{
//				return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
//			}
			OI=UARTCtrl->RMCSD[2+0]<<24;
			OI|=UARTCtrl->RMCSD[2+1]<<16;
			OI|=UARTCtrl->RMCSD[2+2]<<8;
			OI|=UARTCtrl->RMCSD[2+3];
			n=UARTCtrl->TaskID;
			n>>=8;
			n&=0xff;
			n=UARTCtrl->MeterCount[n];//2*RMTASKmax byte各任务已抄电能表计数,主动上报时用于文件中已上报电能表计数
			if(i==0)
			{
				i=CompSourMeterEventCount(n,OI,i);
				UARTCtrl->RMCSDSubCount=1;//抄表CSD子计数(非DL698抄表时)
				return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
			}
			i=CompSourMeterEventCount(n,OI,i);//比较原电能表事件次数;入口:SetNo=档案配置号(0开始),Count=当前次数;返回:0=初始值,1=次数相同,2=次数不同,同时修改原计数,使用ADDR_DATABUFF
			if(i!=2)
			{
				UARTCtrl->RMCSDSubCount=1;//抄表CSD子计数(非DL698抄表时)
				return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
			}
		}
	#endif
		i=Change_Frame_645_to_698(PORTn);//把645的事件数据帧转成698格式
		return i;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
	}
//---事件类结束---
	
	signedDI=signed_DL2007_DI(PORTn);//DL/T-2007数据带有正负符号的数据标识;入口:UARTCtrl->RM_DI;返回:0=没符号，1=有符号
	i=UARTCtrl->RMCSD[1];//当前正在抄的CSD(有数据类型)
	if(i==0)
	{//OAD
		OI=UARTCtrl->RMCSD[2]<<8;//当前正在抄的CSD
		OI|=UARTCtrl->RMCSD[3];
	#if(USER/100)==15//安徽
		s=UARTCtrl->RMCSD[4]<<8;
		s|=UARTCtrl->RMCSD[5];
	#endif
	}
	else
	{//ROAD
		i=UARTCtrl->RMROADCount;//抄表CSD的ROAD内关联的OAD计数(非DL698抄表时)
		i*=4;
		OI=UARTCtrl->RMCSD[7+i]<<8;//当前正在抄的CSD
		OI|=UARTCtrl->RMCSD[7+i+1];
	#if(USER/100)==15//安徽
		s=UARTCtrl->RMCSD[7+i+2]<<8;
		s|=UARTCtrl->RMCSD[7+i+3];
	#endif
	}
	i=OI_IC(OI);//得到接口类号;入口:对象标识OI
	
	LEN_Rx-=4;
	p8rx+=14;
	switch(i)
	{
		case 1://电能量接口类,本接口类对象提供存储电能量类信息
			if(LEN_Data0==0)
			{
				if(LEN_RxDataBuff<2)
				{//缓冲长度不够
					return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
				}
				p8Array[0]=DataType_array;
				p8Array[1]=0;
				LEN_Data0=2;
				LEN_RxDataBuff-=2;
			}
			switch(UARTCtrl->RMCSD[4])//属性
			{
				case 2://总及费率电能量数组∷=array 电能量
				//电能量：
				//CHOICE
				//{
				//double-long-unsigned   [6]，
				//double-long            [5]
				//}
					LEN_Rx/=4;//数组数;DL2007返回数据格式:XXXXXX.XX
					if(LEN_RxDataBuff<(5*LEN_Rx))
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Data+=LEN_Data0;
					for(i=0;i<LEN_Rx;i++)
					{
						Data=p8rx[0]|(p8rx[1]<<8)|(p8rx[2]<<16)|(p8rx[3]<<24);
						if(signedDI==0)
						{
							p8Data[0]=DataType_double_long_unsigned;
							Data=bcd_hex(Data);
						}
						else
						{
							p8Data[0]=DataType_double_long;
							if(Data>>31)
							{//负
								Data<<=1;
								Data>>=1;
								Data=bcd_hex(Data);
								Data=~Data;
								Data+=1;
							}
							else
							{
								Data=bcd_hex(Data);
							}
						}
						p8Data[1]=Data>>24;
						p8Data[2]=Data>>16;
						p8Data[3]=Data>>8;
						p8Data[4]=Data>>0;
						p8rx+=4;
						p8Data+=5;
						LEN_Data0+=5;
						if(p8Array[1]>=127)
						{
							return 5;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
						}
						p8Array[1]++;//增加数组数
					}
					p16Data[0]=LEN_Data0;
					break;
//				case 4://高精度总及费率电能量数组∷=array 高精度电能量
//				//高精度电能量：
//				//CHOICE
//				//{
//				//long64-unsigned        [21]，
//				//long64                 [20]
//				//}

//					break;
				default:
					return 4;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
			}
			break;
		case 2://最大需量接口类,本接口类对象提供存储最大需量类信息
			if(LEN_Data0==0)
			{
				if(LEN_RxDataBuff<2)
				{//缓冲长度不够
					return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
				}
				p8Array[0]=DataType_array;
				p8Array[1]=0;
				LEN_Data0=2;
				LEN_RxDataBuff-=2;
			}
			switch(UARTCtrl->RMCSD[4])//属性
			{
				case 2://总及费率最大需量数组∷=array 最大需量及发生时间
				//最大需量及发生时间∷=structure
				//{
				//  最大需量值 CHOICE，
				//  发生时间   date_time_s
				//}
				//最大需量值 ：
				//CHOICE
				//{
				//double-long            [5]，
				//double-long-unsigned   [6]
				//}
					LEN_Rx/=8;//数组数;DL2007返回数据格式:XX.XXXX YYMMDDhhmm
					if(LEN_RxDataBuff<(13*LEN_Rx))
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Data+=LEN_Data0;
					for(i=0;i<LEN_Rx;i++)
					{
						//值
						Data=p8rx[0]|(p8rx[1]<<8)|(p8rx[2]<<16);
						if(Data==0xffffff)
						{//空
							p8rx+=8;
							continue;
						}
						p8Data[0]=DataType_structure;
						p8Data[1]=2;
						p8Data+=2;
						if(signedDI==0)
						{
							p8Data[0]=DataType_double_long_unsigned;
							Data=bcd_hex(Data);
						}
						else
						{
							p8Data[0]=DataType_double_long;
							if(Data>>23)
							{//负
								Data<<=9;
								Data>>=9;
								Data=bcd_hex(Data);
								Data=~Data;
								Data+=1;
							}
							else
							{
								Data=bcd_hex(Data);
							}
						}
						p8Data[1]=Data>>24;
						p8Data[2]=Data>>16;
						p8Data[3]=Data>>8;
						p8Data[4]=Data>>0;
						p8rx+=3;
						p8Data+=5;
						//发生时间
						p8Data[0]=DataType_date_time_s;
						Data=p8rx[4];//年
						Data=bcd_hex(Data);
						Data+=2000;
						p8Data[1]=Data>>8;
						p8Data[2]=Data;
						Data=p8rx[3];//月
						Data=bcd_hex(Data);
						p8Data[3]=Data;
						Data=p8rx[2];//日
						Data=bcd_hex(Data);
						p8Data[4]=Data;
						Data=p8rx[1];//时
						Data=bcd_hex(Data);
						p8Data[5]=Data;
						Data=p8rx[0];//分
						Data=bcd_hex(Data);
						p8Data[6]=Data;
						p8Data[7]=0;//秒
						p8rx+=5;
						p8Data+=8;
						
						LEN_Data0+=2+5+8;;
						if(p8Array[1]>=127)
						{
							return 5;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
						}
						p8Array[1]++;//增加数组数
					}
					p16Data[0]=LEN_Data0;
					break;
				default:
					return 4;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
			}
			break;
		case 3://分相变量接口类,本接口类对象提供存储电压、电流、相角等分相变量类信息
		//分相数值组∷=array 分相数值
		//数值组按A相、B相、C相、N线顺序排列，其中：仅电流有N线，另外，当接线方式为单相时，A、B、C三相改为A相（某一相）。
			if(LEN_Data0==0)
			{
				if(LEN_RxDataBuff<2)
				{//缓冲长度不够
					return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
				}
				p8Array[0]=DataType_array;
				p8Array[1]=0;
				LEN_Data0=2;
				LEN_RxDataBuff-=2;
			}
			switch(UARTCtrl->RMCSD[4])//属性
			{
				case 2://分相数值组
					switch(OI)
					{
						case 0x2000://电压
							LEN_Rx/=2;//数组数;DL2007返回数据格式:XXX.X
							if(LEN_RxDataBuff<(3*LEN_Rx))
							{//缓冲长度不够
								return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
							}
							p8Data+=LEN_Data0;
							for(i=0;i<LEN_Rx;i++)
							{
								Data=p8rx[0]|(p8rx[1]<<8);
								if(Data==0xffff)
								{
									p8rx+=2;
									continue;
								}
								Data=bcd_hex(Data);
								p8Data[0]=DataType_long_unsigned;
								p8Data[1]=Data>>8;
								p8Data[2]=Data;
								p8rx+=2;
								p8Data+=3;
								LEN_Data0+=3;
								if(p8Array[1]>=127)
								{
									return 5;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
								}
								p8Array[1]++;//增加数组数
							}
							p16Data[0]=LEN_Data0;
							break;
						case 0x2001://电流
							LEN_Rx/=3;//数组数;DL2007返回数据格式:XXX.XXX
							if(LEN_RxDataBuff<(5*LEN_Rx))
							{//缓冲长度不够
								return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
							}
							p8Data+=LEN_Data0;
							for(i=0;i<LEN_Rx;i++)
							{
								Data=p8rx[0]|(p8rx[1]<<8)|(p8rx[2]<<16);
								if(Data==0xffffff)
								{
									p8rx+=3;
									continue;
								}
								if(Data>>23)
								{//负
									Data<<=9;
									Data>>=9;
									Data=bcd_hex(Data);
									Data=~Data;
									Data+=1;
								}
								else
								{
									Data=bcd_hex(Data);
								}
								p8Data[0]=DataType_double_long;
								p8Data[1]=Data>>24;
								p8Data[2]=Data>>16;
								p8Data[3]=Data>>8;
								p8Data[4]=Data>>0;
								p8rx+=3;
								p8Data+=5;
								LEN_Data0+=5;
								if(p8Array[1]>=127)
								{
									return 5;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
								}
								p8Array[1]++;//增加数组数
							}
							p16Data[0]=LEN_Data0;
							break;
						case 0x2002://电压相角
						case 0x2003://电压电流相角
							LEN_Rx/=2;//数组数;DL2007返回数据格式:XXX.X
							if(LEN_RxDataBuff<(3*LEN_Rx))
							{//缓冲长度不够
								return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
							}
							p8Data+=LEN_Data0;
							for(i=0;i<LEN_Rx;i++)
							{
								Data=p8rx[0]|(p8rx[1]<<8);
								if(Data==0xffff)
								{
									p8rx+=2;
									continue;
								}
								Data=bcd_hex(Data);
								p8Data[0]=DataType_long_unsigned;
								p8Data[1]=Data>>8;
								p8Data[2]=Data;
								p8rx+=2;
								p8Data+=3;
								LEN_Data0+=3;
								if(p8Array[1]>=127)
								{
									return 5;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
								}
								p8Array[1]++;//增加数组数
							}
							p16Data[0]=LEN_Data0;
							break;
						case 0x200B://电压波形失真度
						case 0x200C://电流波形失真度
							LEN_Rx/=2;//数组数;DL2007返回数据格式:XX.XX
							if(LEN_RxDataBuff<(3*LEN_Rx))
							{//缓冲长度不够
								return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
							}
							p8Data+=LEN_Data0;
							for(i=0;i<LEN_Rx;i++)
							{
								Data=p8rx[0]|(p8rx[1]<<8);
								if(Data==0xffff)
								{
									p8rx+=2;
									continue;
								}
								if(Data>>15)
								{//负
									Data<<=17;
									Data>>=17;
									Data=bcd_hex(Data);
									Data=~Data;
									Data+=1;
								}
								else
								{
									Data=bcd_hex(Data);
								}
								p8Data[0]=DataType_long;
								p8Data[1]=Data>>8;
								p8Data[2]=Data;
								p8rx+=2;
								p8Data+=3;
								LEN_Data0+=3;
								if(p8Array[1]>=127)
								{
									return 5;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
								}
								p8Array[1]++;//增加数组数
							}
							p16Data[0]=LEN_Data0;
							break;
						default:
							return 4;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					break;
				case 4://零线电流
					switch(OI)
					{
						case 0x2001://电流
							LEN_Rx=1;//数组数;DL2007返回数据格式:XXX.XXX
							if(LEN_RxDataBuff<(5*LEN_Rx))
							{//缓冲长度不够
								return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
							}
							LEN_Data0=0;//零线电流无数组
							p8Data+=LEN_Data0;
							for(i=0;i<LEN_Rx;i++)
							{
								Data=p8rx[0]|(p8rx[1]<<8)|(p8rx[2]<<16);
								if(Data==0xffffff)
								{
									p8rx+=3;
									continue;
								}
								if(Data>>23)
								{//负
									Data<<=9;
									Data>>=9;
									Data=bcd_hex(Data);
									Data=~Data;
									Data+=1;
								}
								else
								{
									Data=bcd_hex(Data);
								}
								p8Data[0]=DataType_double_long;
								p8Data[1]=Data>>24;
								p8Data[2]=Data>>16;
								p8Data[3]=Data>>8;
								p8Data[4]=Data>>0;
								p8rx+=3;
								p8Data+=5;
								LEN_Data0+=5;
								//零线电流无数组
//								if(p8Array[1]>=127)
//								{
//									return 5;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
//								}
//								p8Array[1]++;//增加数组数
							}
							p16Data[0]=LEN_Data0;
							break;
						default:
							return 4;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					break;
				default:
					return 4;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
			}
			break;
		case 4://功率接口类,本接口类对象提供存储功率、功率因数等信息
			//总及分相数值组∷=array 总或分相数值
			//数值组按总、A相、B相、C相顺序排列，当接线方式为单相时，为总、A相（某一相）
			if(LEN_Data0==0)
			{
				if(LEN_RxDataBuff<2)
				{//缓冲长度不够
					return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
				}
				p8Array[0]=DataType_array;
				p8Array[1]=0;
				LEN_Data0=2;
				LEN_RxDataBuff-=2;
			}
			switch(UARTCtrl->RMCSD[4])//属性
			{
				case 2://总及分相数值组
					switch(OI)
					{
						case 0x2004://有功功率
						case 0x2005://无功功率
							if(UARTCtrl->RMCSD[1]==1)
							{//读记录
								if(((UARTCtrl->RMCSD[2]<<8)+UARTCtrl->RMCSD[3])==0x5004)
								{//日冻结:上1次日冻结变量数据（字节数3*8）(总/A/B/C有功功率,总/A/B/C无功功率)
									if(LEN_Rx!=24)
									{
										return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
									}
									LEN_Rx-=12;
									if(OI==0x2005)//无功功率
									{
										p8rx+=12;//跳过有功功率
									}
								}
							}
						case 0x2006://视在功率
						case 0x2007://一分钟平均有功功率
						case 0x2008://一分钟平均无功功率
						case 0x2009://一分钟平均视在功率
							LEN_Rx/=3;//数组数;DL2007返回数据格式:XX.XXXX
							if(LEN_RxDataBuff<(5*LEN_Rx))
							{//缓冲长度不够
								return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
							}
							p8Data+=LEN_Data0;
							for(i=0;i<LEN_Rx;i++)
							{
								Data=p8rx[0]|(p8rx[1]<<8)|(p8rx[2]<<16);
								if(Data==0xffffff)
								{
									p8rx+=3;
									continue;
								}
								if(Data>>23)
								{//负
									Data<<=9;
									Data>>=9;
									Data=bcd_hex(Data);
									Data=~Data;
									Data+=1;
								}
								else
								{
									Data=bcd_hex(Data);
								}
								p8Data[0]=DataType_double_long;
								p8Data[1]=Data>>24;
								p8Data[2]=Data>>16;
								p8Data[3]=Data>>8;
								p8Data[4]=Data>>0;
								p8rx+=3;
								p8Data+=5;
								LEN_Data0+=5;
								if(p8Array[1]>=127)
								{
									return 5;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
								}
								p8Array[1]++;//增加数组数
							}
							p16Data[0]=LEN_Data0;
							break;
						case 0x200A://功率因数
							LEN_Rx/=2;//数组数;DL2007返回数据格式:XX.XX
							if(LEN_RxDataBuff<(3*LEN_Rx))
							{//缓冲长度不够
								return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
							}
							p8Data+=LEN_Data0;
							for(i=0;i<LEN_Rx;i++)
							{
								Data=p8rx[0]|(p8rx[1]<<8);
								if(Data==0xffff)
								{
									p8rx+=2;
									continue;
								}
								if(Data>>15)
								{//负
									Data<<=17;
									Data>>=17;
									Data=bcd_hex(Data);
									Data=~Data;
									Data+=1;
								}
								else
								{
									Data=bcd_hex(Data);
								}
								p8Data[0]=DataType_long;
								p8Data[1]=Data>>8;
								p8Data[2]=Data;
								p8rx+=2;
								p8Data+=3;
								LEN_Data0+=3;
								if(p8Array[1]>=127)
								{
									return 5;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
								}
								p8Array[1]++;//增加数组数
							}
							p16Data[0]=LEN_Data0;
							break;
						default:
							return 4;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					break;
				default:
					return 4;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
			}
			break;
//		case 5://谐波变量接口类,本接口类对象提供存储谐波变量类信息
//			break;
		case 6://数据变量接口类,本接口类对象提供存储过程值或与过程值单元相关的状态值信息
			switch(OI)
			{
			#if(USER/100)==15//安徽
				case 0x2131://月A相电压合格率
				case 0x2132://月B相电压合格率
				case 0x2133://月C相电压合格率
					if(((s>>8)&0xff)==2&&(s&0xff)!=0)//月电压合格率或者日电压合格率
					{
						if(LEN_RxDataBuff<15)
						{//缓冲长度不够
							return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
						}
						p8Data+=LEN_Data0;
						p8Data[0]=DataType_structure;
						p8Data[1]=5;
						p8Data+=2;
						LEN_Data0+=2;
						LEN_RxDataBuff-=2;
						Data=p8rx[0]|(p8rx[1]<<8)|(p8rx[2]<<16);
						if(Data==0xffffff)
						{
							Data=0;
						}
						Data=bcd_hex(Data);
						p8Data[0]=DataType_double_long_unsigned;
						p8Data[1]=Data>>24;
						p8Data[2]=Data>>16;
						p8Data[3]=Data>>8;
						p8Data[4]=Data>>0;
						p8Data+=5;
						LEN_Data0+=5;
						LEN_RxDataBuff-=5;
						p8rx+=3;
						
						Data=p8rx[0]|(p8rx[1]<<8)|(p8rx[2]<<16);
						if(Data==0xffffff)
						{
							Data=0;
						}
						Data=bcd_hex(Data);
						p8Data[0]=DataType_long_unsigned;
						p8Data[1]=Data>>8;
						p8Data[2]=Data;
						p8Data+=3;
						LEN_Data0+=3;
						LEN_RxDataBuff-=3;
						p8rx+=3;
						
						Data=p8rx[0]|(p8rx[1]<<8)|(p8rx[2]<<16);
						if(Data==0xffffff)
						{
							Data=0;
						}
						Data=bcd_hex(Data);
						p8Data[0]=DataType_long_unsigned;
						p8Data[1]=Data>>8;
						p8Data[2]=Data;
						p8Data+=3;
						LEN_Data0+=3;
						LEN_RxDataBuff-=3;
						p8rx+=3;
						
						Data=p8rx[0]|(p8rx[1]<<8)|(p8rx[2]<<16);
						if(Data==0xffffff)
						{
							Data=0;
						}
						Data=bcd_hex(Data);
						p8Data[0]=DataType_double_long_unsigned;
						p8Data[1]=Data>>24;
						p8Data[2]=Data>>16;
						p8Data[3]=Data>>8;
						p8Data[4]=Data>>0;
						p8Data+=5;
						LEN_Data0+=5;
						LEN_RxDataBuff-=5;
						p8rx+=3;
						
						Data=p8rx[0]|(p8rx[1]<<8)|(p8rx[2]<<16);
						if(Data==0xffffff)
						{
							Data=0;
						}
						Data=bcd_hex(Data);
						p8Data[0]=DataType_double_long_unsigned;
						p8Data[1]=Data>>24;
						p8Data[2]=Data>>16;
						p8Data[3]=Data>>8;
						p8Data[4]=Data>>0;
						p8Data+=5;
						LEN_Data0+=5;
						LEN_RxDataBuff-=5;
						p8rx+=3;
						
