gdgly/NUC97X_JS/STM32F4xx/DL698/RM_RxDATA_DL2007.cpp
						p16Data[0]=LEN_Data0;
					}
					break;
				#endif
				case 0x2014://电表运行状态字1-7
					LEN_Rx/=2;//数组数;DL2007返回数据格式:2byte状态字1...2byte状态字7
					if(LEN_RxDataBuff<(2+(4*LEN_Rx)))
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Array[0]=DataType_array;
					p8Array[1]=0;
					LEN_Data0=2;
					LEN_RxDataBuff-=2;
					p8Data+=LEN_Data0;
					for(i=0;i<LEN_Rx;i++)
					{
						p8Data[0]=DataType_bit_string;
						p8Data[1]=16;
						Data=p8rx[0];
						Data=Bit_Inverse(Data,8);//寄存器数据位倒序(高低位调换),入口:Data=寄存器数据,bit=需倒序的位个数;返回:位倒序后的数据
						p8Data[2]=Data;
						Data=p8rx[1];
						Data=Bit_Inverse(Data,8);//寄存器数据位倒序(高低位调换),入口:Data=寄存器数据,bit=需倒序的位个数;返回:位倒序后的数据
						p8Data[3]=Data;
						
						p8Data+=4;
						p8Array[1]++;
						LEN_Data0+=4;
						LEN_RxDataBuff-=4;
						p8rx+=2;
					}
					p16Data[0]=LEN_Data0;
					break;
				case 0x202D://（当前）透支金额  数据类型：double-long-unsigned，单位：元，换算：-2
					if(LEN_RxDataBuff<5)
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Data+=LEN_Data0;
					Data=p8rx[6]|(p8rx[7]<<8)|(p8rx[8]<<16)|(p8rx[9]<<24);
					Data=bcd_hex(Data);
					p8Data[0]=DataType_double_long_unsigned;
					p8Data[1]=Data>>24;
					p8Data[2]=Data>>16;
					p8Data[3]=Data>>8;
					p8Data[4]=Data;
					LEN_Data0+=5;
					LEN_RxDataBuff-=5;
					p16Data[0]=LEN_Data0;
					break;
				default:
					return 4;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
			}
			break;
//		case 7://事件对象接口类,本接口类对象提供配置、存储事件记录类信息
//			break;
		case 8://参数变量接口类,本接口类对象提供存储终端的各种参数类信息
			switch(OI)
			{
				case 0x2021://数据冻结时间
					if(LEN_RxDataBuff<8)
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					if(UARTCtrl->RM_DI==0x00FE0001)//DL/T645-2007/1997当前抄表数据标识
					{//是上一结算日的冻结时标，只有年月日时4字节
						for(i=0;i<4;i++)
						{
							Data=p8rx[i];
							Data=bcd_hex(Data);
							p8rx[i]=Data;
						}
						p8Data+=LEN_Data0;
						p8Data[0]=DataType_date_time_s;
						Data=p8rx[3];//年
						Data+=2000;
						p8Data[1]=Data>>8;
						p8Data[2]=Data;
						p8Data[3]=p8rx[2];//月
						p8Data[4]=p8rx[1];//日
						p8Data[5]=p8rx[0];//时
						p8Data[6]=0;//分
						p8Data[7]=0;//秒
						LEN_Data0+=8;
						p16Data[0]=LEN_Data0;
						break;
					}
					//时标，年月日时分5字节
					for(i=0;i<5;i++)
					{
						Data=p8rx[i];
						Data=bcd_hex(Data);
						p8rx[i]=Data;
					}
					p8Data+=LEN_Data0;
					p8Data[0]=DataType_date_time_s;
					Data=p8rx[4];//年
					Data+=2000;
					p8Data[1]=Data>>8;
					p8Data[2]=Data;
					p8Data[3]=p8rx[3];//月
					p8Data[4]=p8rx[2];//日
					p8Data[5]=p8rx[1];//时
					p8Data[6]=p8rx[0];//分
					p8Data[7]=0;//秒
					LEN_Data0+=8;
					p16Data[0]=LEN_Data0;
//				#if CompareTime_5004==1//抄读日冻结是否比较冻结时间:0=不比较,1=比较
//					i=UARTCtrl->RMCSD[1];//当前正在抄的CSD(有数据类型)
//					if(i==1)
//					{//ROAD
//						OI=UARTCtrl->RMCSD[2]<<24;//当前正在抄的OAD
//						OI|=UARTCtrl->RMCSD[2+1]<<16;
//						OI|=UARTCtrl->RMCSD[2+2]<<8;
//						OI|=UARTCtrl->RMCSD[2+3]<<0;
//						if(OI==0x50040200)
//						{//日冻结
//							i=UARTCtrl->RMROADCount;//抄表CSD的ROAD内关联的OAD计数(非DL698抄表时)
//							i*=4;
//							OI=UARTCtrl->RMCSD[7+i]<<24;//当前正在抄的CSD
//							OI|=UARTCtrl->RMCSD[7+i+1]<<16;
//							OI|=UARTCtrl->RMCSD[7+i+2]<<8;
//							OI|=UARTCtrl->RMCSD[7+i+3]<<0;
//							if(OI==0x20210200)
//							{//数据冻结时间
//								for(i=0;i<4;i++)
//								{
//									if(p8Data[1+i]!=Comm_Ram->DL698YMDHMS[i])
//									{
//										break;
//									}
//								}
//								if(i<4)
//								{//年月日不同
//									LEN_Data0=0;
//									p16Data[0]=LEN_Data0;
//								}
//							}
//						}
//					}
//				#endif
					break;
				case 0x4000://日期时间
					switch(UARTCtrl->RMCSDSubCount)//抄表CSD子计数(非DL698抄表时)
					{
						case 0://电能表日历时钟Hhmmss
							if(LEN_RxDataBuff<8)
							{//缓冲长度不够
								return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
							}
							for(i=0;i<3;i++)
							{
								Data=p8rx[i];
								Data=bcd_hex(Data);
								p8rx[i]=Data;
							}
							p8Data+=LEN_Data0;
							p8Data[0]=DataType_date_time_s;
							p8Data[1]=0;//年
							p8Data[2]=0;
							p8Data[3]=0;//月
							p8Data[4]=0;//日
							p8Data[5]=p8rx[2];//时
							p8Data[6]=p8rx[1];//分
							p8Data[7]=p8rx[0];//秒
							LEN_Data0+=8;
							p16Data[0]=LEN_Data0;
							break;
						case 1://电能表日历时钟YYMMDDWW
							if(LEN_Data0<8)
							{
								break;//已填写入buff但还没完整一个CSD的数据长度
							}
							p8Data+=LEN_Data0;
							p8Data-=8;
							Data=p8rx[3];//年
							Data=bcd_hex(Data);
							Data+=2000;
							p8Data[1]=Data>>8;
							p8Data[2]=Data;
							Data=p8rx[2];//月
							Data=bcd_hex(Data);
							p8Data[3]=Data;//月
							Data=p8rx[1];//日
							Data=bcd_hex(Data);
							p8Data[4]=Data;//日
							break;
					}
					break;
				case 0x202C://（当前）钱包文件 剩余金额	double-long-unsigned（单位：元，换算：-2）， 购电次数	double-long-unsigned
					if(LEN_RxDataBuff<(2+5+5))
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Data+=LEN_Data0;
					p8Data[0]=DataType_structure;
					p8Data[1]=2;
					//剩余金额	double-long-unsigned（单位：元，换算：-2）
					Data=p8rx[2]|(p8rx[3]<<8)|(p8rx[4]<<16)|(p8rx[5]<<24);
					Data=bcd_hex(Data);
					p8Data[2]=DataType_double_long_unsigned;
					p8Data[3]=Data>>24;
					p8Data[4]=Data>>16;
					p8Data[5]=Data>>8;
					p8Data[6]=Data;
					//购电次数	double-long-unsigned
					Data=p8rx[0]|(p8rx[1]<<8);
					Data=bcd_hex(Data);
					p8Data[7]=DataType_double_long_unsigned;
					p8Data[8]=Data>>24;
					p8Data[9]=Data>>16;
					p8Data[10]=Data>>8;
					p8Data[11]=Data;
					LEN_Data0+=12;
					LEN_RxDataBuff-=12;
					p16Data[0]=LEN_Data0;
					break;
			}
			break;
//		case 9://冻结数据接口类,本接口类对象提供配置、存储冻结数据及其相关信息
//			break;
//		case 10://采集监控接口类
//			break;
//		case 11://集合接口类,本接口类对象提供配置、存储终端采集数据及其相关信息
//			break;
//		case 12://脉冲计量接口类
//			break;
//		case 13://负荷控制对象接口类,本接口类对象提供负荷管理有关的控制功能
//			break;
//		case 14://区间统计接口类,本接口类对象提供依据配置参数判定、统计与越限相关的信息
//			break;
//		case 15://累加平均接口类,本接口类对象提供对相同物理属性的数值进行累加、平均的运算功能
//			break;
//		case 16://极值工具接口类,本接口类对象提供采集或生成最大、最小值及其发生时间
//			break;
//		case 17://显示接口类,本接口类对象提供与终端显示或对外打印相关的信息
//			break;
//		case 18://文件传输接口类,本接口类对象提供终端实现上传和下载文件的功能
//			break;
//		case 19://设备管理接口类,
//			break;
//		case 20://应用连接接口类
//			break;
//		case 21://ESAM接口类
//			break;
//		case 22://输入输出设备接口类
//			break;
//		case 23://总加组接口类
//			break;
//		case 24://分项事件对象接口类,本接口类对象提供配置、存储分项事件记录类信息
//			break;
//		case 25://无线公网通信接口类
//			break;
//		case 26://以太网通信接口类
//			break;
		default:
			//测试看未处理的OI值
			i=OI_IC(OI);//得到接口类号;入口:对象标识OI
			if(i)
			{
				i=i;
			}
			return 4;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
	}
	return 0;
}

















